# IsAWorkingFile

## Description
Returns True if the current document is a Project Sharing Working File. Otherwise returns False.

```pascal
FUNCTION IsAWorkingFile : BOOLEAN;
```

```python
def vs.IsAWorkingFile():
    return BOOLEAN
```

## Version
Availability: from Vectorworks 2016

## Category
* Project Sharing